Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L12.tmx
Source language: en_us
Languages: zh_cn

source: "Nobody understands me sure we've got money but money isn't everything and the other day my housekeeper looks at me like I'm from outer space and it's not my fault and I get so angry when my mother wants to go shopping on my one day off and I think Samuel's seeing someone and I think my son's gay and I just cannot lose these fifteen pounds..."
zh_cn: “没人理解我没错我们有很多钱但钱不是一切有一天我的管家看我的样子好像我来自外太空我非常生气因为我妈在我休息的时候要去购物我想萨穆埃尔有外遇了我觉得我儿子是个同性恋我无法接受自己丢了十五磅......”

source: Their troubles may have been plebeian, even laughably minor at times, but his oath, as well as his character, wouldn't let Harry minimize them. He worked hard to help his patients.
zh_cn: 他们的问题也许粗俗，甚至有时是一些可笑的小事，但他的誓言，同时也是他的性格，不允许自己小看他们，他总是竭尽全力帮助他的病人。

source: And all the while he neglected what he really wanted to do. Which was to treat severe mental cases.
zh_cn: 长久以来，他一直忽略自己真正想做的事情：处理一些严重的精神病案例。

source: People who were paranoid schizophrenics, people with bipolar depression and borderline personalities- people who led sorrowful lives and couldn't hide from that sorrow with the money that Harry's patients had.
zh_cn: 比如那些患有偏执狂的精神分裂者，两级型忧郁症患者，边际型人格。还有那些痛苦生活着的人，那些不能把自己的痛苦藏匿在金钱之下的人。

source: From time to time he had volunteered at various clinics- particularly a small one in Brooklyn that treated homeless men and women- but with his Park Avenue caseload and his wife's regimen of social obligations, there had been no way he could devote much time to the clinic.
zh_cn: 有时他会到各式各样的诊所担任志愿者——特别是布鲁克林的一家专门为无家可归的人提供服务的小诊所——但公园大道里的那些案例以及他妻子对社会义务活动的控制，让他不可能投入更多的时间到那所诊所去。

source: He'd wrestled with the thought of just chucking his Park Avenue practice.
zh_cn: 他努力抑制着自己抛弃公园大道工作的想法。

source: Of course, if he'd done that, his income would have dropped by ninety percent.
zh_cn: 当然，如果他这么做的话，他的收入将会减少百分之九十。

source: He and Linda had had two children a couple of years after they'd gotten married- two sweet daughters Harry loved very much- and their needs, very expensive needs, private school sorts of needs, had taken priority over his personal contentment.
zh_cn: 他和琳达结婚几年后就有了两个孩子——两个可爱的女儿，哈里非常爱她们——但她们的需求却十分昂贵，比如私立学校的费用，这些早已排在他个人需求之前了。

source: Besides, as idealistic as he was in many ways, Harry had known that Linda would leave him in a flash if he'd started working full-time in Brooklyn.
zh_cn: 除此之外，在许多方面他都是一个完美主义者，他知道，如果他开始在布鲁克林进行全职工作，琳达就会马上离开他。

source: But the irony was that even after Linda did leave him- for someone she'd met at one of the society benefits that Harry couldn't bear to attend- he hadn't been able to spend any more time at the clinic than he had when he'd been married.
zh_cn: 但讽刺的是，即便琳达最终离开了他——因为某个她在其中一个社会福利俱乐部中碰见的人，哈里无力承担那个俱乐部的费用——与结婚时相比，他还是不能在那个诊所里花费更多的时间。

source: The debts Linda had run up while they were married were excruciating.
zh_cn: 他们结婚时，琳达积累的债务一直折磨着他。

source: His oldest daughter was in an expensive college and his younger was on her way to Vassar next year.
zh_cn: 他的大女儿正在上一所费用昂贵的大学，而小女儿明年则要去瓦萨尔学院。

source: Yet, out of the dozens of patients who whined about minor dissatisfactions, here came Patsy Randolph, a truly desperate patient: a woman telling him about ghosts, about her husband trying to drive her insane, a woman clearly on the brink.
zh_cn: 然而，在这些病人为种种小小的不满抱怨不已的时候，帕特西·兰多夫出现了，一个真正绝望的病人：一个告诉他有关幽灵的事情的女人，一个认为自己的丈夫正在把她逼疯的女人，一个明显处在崩溃边缘的女人。

source: A patient, at last, who would give Harry a chance to redeem his life.
zh_cn: 最终，一个病人给了哈里挽回自己生活的机会。

source: That night he didn't bother with dinner. He came home and went straight into his den, where sat stacked in high piles a year's worth of the professional journals that he'd never bothered to read since they dealt with serious psychiatric issues and didn't much affect the patients in his practice.
zh_cn: 当天晚上，哈里没有考虑晚餐的问题，他到家后就径直走进自己的卧室，那里高高堆放着一整个年度的颇有价值的专业期刊，他从来没有费心去阅读它们，因为它们处理的都是一些严重的精神疾病，而这些对于哈里的病人来说，没有太多的用处。

source: Harry was rereading an obscure article in theJournal of Psychoses, which he'd been thrilled to find- it was the key to dealing with her case- when he sat up, hearing a shrill whistle.
zh_cn: 哈里不断重读着一本精神病杂志中晦涩的文章，能找到这篇文章，他觉得很激动，这正是解决帕特西的案例的钥匙。当他坐下时，他听到一声尖锐的哨声。

source: He'd been so preoccupied... had he forgotten he'd put on the tea kettle for coffee?
zh_cn: 难道他全神贯注于文章之中，完全忘记了他用平底壶烧水泡咖啡的事？

source: But then he glanced out the window and realized that it wasn't the kettle at all. The sound was from a bird sitting on a branch nearby, singing.
zh_cn: 但随后他朝窗外看去，才发现不是平底壶发出的声音，那是一只停在附近的树枝上的鸟正在鸣唱。

source: The hour was well past dawn.
zh_cn: 此刻已经过了黎明。

source: At her next session Patsy looked worse than she had the week before.
zh_cn: 在她的下一个疗程的时候，帕特西看起来比一周前更糟糕。

source: Her clothes weren't pressed. Her hair was matted and hadn't been shampooed for days, it seemed.
zh_cn: 她的衣服没有扣上，她的头发黯淡无关，仿佛已经数天没有清洗了。

source: Her white blouse was streaked with dirt and the collar was torn, as was her skirt.
zh_cn: 她白色的衬衣沾上了污垢，衣领则扯裂了。

source: There were runs in her stockings.
zh_cn: 她的裙子也是一样，而且跑进了她的丝袜中。

source: Only her makeup was carefully done.
zh_cn: 只有她的妆容经过了仔细的处理。

source: "Hello, Doctor," she said in a soft voice. She sounded timid.
zh_cn: “你好，医生，”她轻柔地说道，听起来很胆怯。

source: "Hi, Patsy, come on in...
zh_cn: “你好，帕特西，进来吧......

source: No, not the couch today. Sit across from me."
zh_cn: 不是，今天不需要坐在沙发上，坐到我对面来。”

source: She hesitated. "Why?"
zh_cn: “为什么？”她犹豫道。

source: "I think we'll postpone our usual work and deal with this crisis. About the voices.
zh_cn: “我想我们先延后一般治疗，来解决一下关于那个声音的问题。

source: I'd like to see you face-to-face."
zh_cn: 我想和你面对面谈谈。”

source: "Crisis," she repeated the word warily as she sat in the comfortable armchair across from his desk.
zh_cn: “问题，”她警惕地重复着这个词，与此同时，坐进了他办公桌对面的那个舒适的扶手椅里。

source: She crossed her arms, looked out the window- these were all body-language messages that Harry recognized well.
zh_cn: 她交叉着手臂，望着窗外——所有的这些身势语说传达的信息，哈里都明白。

source: They meant she was nervous and defensive.
zh_cn: 这意味着她觉得紧张且充满防备。

source: "Now, what's been happening since I saw you last?" he asked.
zh_cn: “现在我们来谈谈，自从上次我见你之后发生什么？”他问道。

source: She told him. There'd been more voices- her husband kept pretending to be the ghost of her father, whispering terrible things to her.
zh_cn: 她告诉他，声音越来越多了——她的丈夫不停地扮作是她父亲的幽灵，朝她低声说着一些可怕的事情。

source: What, Harry asked, had the ghost said?
zh_cn: 哈里问道，幽灵都说了些什么？

source: She answered: what a bad daughter she'd been, what a terrible wife she was now, what a shallow friend.
zh_cn: 她回答，她是一个多么糟糕的女儿，现在又是一个糟糕的妻子，肤浅的朋友。

source: Why didn't she just kill herself and quit bringing pain to everyone's life?
zh_cn: 为什么她不自杀，还一直给每个人的生活带来困扰。

source: Harry jotted a note. "Did it sound like your father's voice?
zh_cn: 哈里摘记了下来：“听起来像你父亲的声音吗？

source: The tone, I mean?"
zh_cn: 我说的是腔调。”

source: "Not my father," she said, her voice cracking with anger. "It was my husband, pretending to be my father. I told you that."
zh_cn: “不是我父亲的声音，”她说，她的声音里充满了怒气，“是我丈夫的，他假扮成我父亲，我告诉过你的。”

source: "I know. But the sound?
zh_cn: “我明白，但声音像吗？

source: The timbre?"
zh_cn: 音色想你父亲吗？”

source: She thought. "Maybe.
zh_cn: 她想了想：“有点像。

source: But my husband had met him. And there are videos of dad. Peter must've heard them and impersonated him."
zh_cn: 但我丈夫见过他，而且还有我父亲的录像在，彼得一定是听过那些录像带，然后模仿他的”

source: "Where was Peter when you heard him?"
zh_cn: “你听到他的声音的时候，彼得在什么地方？”

source: She studied a bookshelf. "He wasn't exactly home."
zh_cn: 她仔细看着一个书架，然后说道：“他不在家。”

source: "He wasn't?"
zh_cn: “他不在？”

source: "No. He went out for cigarettes.
zh_cn: “是的，他出去抽烟了。

source: But I figured out how he did it.
zh_cn: 但我知道他是怎么做到的。

source: He must've rigged up some kind of a speaker and tape recorder.
zh_cn: 他肯定是装了某种话筒和录音机。

source: Or maybe one of those walkie-talkie things."
zh_cn: 或者就像是对讲机一类的东西。”

source: Her voice faded.
zh_cn: 她的声音慢慢低了下去。

source: "Peter's also a good mimic. You know, doing impersonations. So he could doall the voices."
zh_cn: “彼得很懂得模仿，非常擅长，所以他可以模仿所有那些声音。”

source: "All of them?"
zh_cn: “所有那些声音？”

source: She cleared her throat. "There were more ghosts this time."
zh_cn: 她清了清喉咙：“这回出现了更多幽灵。”

source: Her voice rising again, manically.
zh_cn: 她的声调再次提高了，显得有些暴躁。

source: "My grandfather. My mother. Others. I don't even know who."
zh_cn: “我祖父的，我妈妈的，还有其他一些我根本不认识的人。”

source: Patsy stared at him for a moment then looked down.
zh_cn: 帕特西盯着他看了一会儿，随后低下了头。

source: She clicked her purse latch compulsively, then looked inside, took out her compact and lipstick.
zh_cn: 她神经质地打开钱包栓，往里面看去，而后拿出她的小粉盒和唇膏。

source: She stared at the makeup, put it away.
zh_cn: 她凝视了片刻自己的妆容，而后将小粉盒拿开。

source: Her hands were shaking.
zh_cn: 她的手在颤抖着。

source: Harry waited a long moment.
zh_cn: 哈里等待了很长一段时间。

source: "Patsy...
zh_cn: “帕特西......

source: I want to ask you something."
zh_cn: 我想问你一些事情。”

source: "You can ask me anything, Doctor."
zh_cn: “你可以问我任何事情，医生。”

source: "Just assume- for the sake of argument- that Peter wasn't pretending to be the ghosts. Where else could they be coming from?"
zh_cn: “我们来做个假设——仅仅是个讨论——如果彼得没有假装成幽灵，它们还有可能从什么地方来呢？”

source: She snapped, "You don't believe a word of this, do you?"
zh_cn: 她急促地说道：“你不相信我说的话，对吧？”

source: The most difficult part of being a therapist is making sure your patients know you're on their side, while you continue pursuing the truth.
zh_cn: 对于一个治疗师而言，最困难的就是在你不断寻找真相的过程中，让你的病人相信你是站在他一边的。

source: He said evenly, "It's certainly possible- what you're saying about your husband.
zh_cn: 他平稳地说道：“你说的关于你丈夫的事情，绝对是有可能的。

source: But let's put that aside and consider that there's another reason for the voices."
zh_cn: 但我们暂时把这些放置在一边，考虑一下是不是还有其他原因产生了那些声音。”

source: "Which is?"
zh_cn: “你指得是？”

source: "That you did hear something- maybe your husband on the phone, maybe the TV, maybe the radio but whatever it was had nothing to do with ghosts.
zh_cn: “你确实听到了什么——也许是你的丈夫在打电话，也许是从电视里面发出来的，也许是收音机，但无论是什么，都和幽灵没有关系。

source: You projected your own thoughts onto what you heard."
zh_cn: 你把你自己的想法投射到了你听到的东西上面了。”

source: "You're saying it's all in my head."
zh_cn: “你的意思是这些都是都在我的脑子里。”

source: "I'm saying that maybe the words themselves are originating in your subconscious.
zh_cn: “我要说的是，也许这些话语都是源自你的潜意识。

source: What do you think about that?"
zh_cn: 你认为呢？”

source: She considered this for a moment. "I don't know...
zh_cn: 她思考了片刻后说：“我不知道......

source: It could be.
zh_cn: 有可能是这样的。

source: I suppose that makes some sense."
zh_cn: 有道理。”

source: Harry smiled. "That's good, Patsy. That's a good first step, admitting that."
zh_cn: 哈里微笑道：“很好，帕特西，承认是良好的第一步。”

source: She seemed pleased, a student who'd been given a gold star by a teacher.
zh_cn: 她看起来很高兴，仿佛学生收到老师奖励的一颗金色的星星。

source: Then the psychiatrist grew serious. "Now, one thing: When the voices talk about your hurting yourself... you're not going to listen to them, are you?"
zh_cn: 接着精神病医生变得严肃起来：“现在，还有一件事，那个声音让你伤害你自己，你不会听他们的，对不对？”

source: "No, I won't."
zh_cn: “我不会。”

source: She offered a brave smile. "Of course not."
zh_cn: 她露出了勇敢的笑容，“当然不会。”

source: "Good."
zh_cn: “很好。”

source: He glanced at the clock. "I see our time's just about up, Patsy.
zh_cn: 他看了一眼钟，“时间快到了，帕特西。

source: I want you to do something. I want you to keep a diary of what the voices say to you."
zh_cn: 我想要你做件事情，记下那些声音对你说的话，就像日记一样。”

source: "A diary?
zh_cn: “日记？

source: All right."
zh_cn: 好的。”

source: "Write down everything they say and we'll go through it together."
zh_cn: “记下他们说的每一句话，我们会一起熬过去的。”

source: She rose. Turned to him. "Maybe I should just ask one of the ghosts to come along to a session... but then you'd have to charge me double, wouldn't you?"
zh_cn: 她站起身，转向他：“也许我该问问其中一个幽灵，要不要过来参加一次疗程，但我想你会收我双倍的价钱，对不对？”

source: He laughed. "See you next week."
zh_cn: 他笑了：“下周再见。”

source: At three a.m. the next morning Harry was wakened by a phone call.
zh_cn: 次日凌晨三点，哈里被一阵电话铃吵醒。

source: "Dr. Bernstein?"
zh_cn: “伯恩斯坦医生吗？”

source: "Yes?"
zh_cn: “是的，有什么事吗？”

source: "I'm Officer Kavanaugh with the police department."
zh_cn: “我是警察局的卡瓦纳夫警官。”

source: Sitting up, trying to shake off his drowsiness, he thought immediately of Herb, a patient at the clinic in Brooklyn.
zh_cn: 哈里坐起身，试图甩掉环绕他的倦意。

source: The poor man, a mild schizophrenic who was completely harmless, was forever getting beat up because of his gruff, threatening manner.
zh_cn: 他立刻想到了赫伯，一个布鲁克林诊所的病人，他是可怜的人，一个完全无害的，温和的精神分裂患者，但却一直因为他粗鲁生硬，又带有危险性的态度被殴打。

source: But that wasn't the reason for the call.
zh_cn: 但这电话并不是为此打来。

source: "You're Mrs. Patricia Randolphs psychiatrist. Is that correct?"
zh_cn: “你是帕特西亚·兰多夫女士的精神病医生，对吗？”

source: His heart thudded hard. "Yes, I am. Is she all right?"
zh_cn: 他心脏发出“砰”的一声：“是的，她没事吧？”

source: "We've had a call...
zh_cn: “我们接到一个电话......

source: We found her on the street outside her apartment. No one's hurt but she's a bit hysterical."
zh_cn: 发现她在自己公寓外面的街上，没有受伤但她有些歇斯底里。”

source: "I'll be right there."
zh_cn: “我马上赶到。”

source: When he arrived at the Randolphs' apartment building, ten blocks away, Harry found Patsy and her husband in the front lobby. A uniformed policeman stood next to them.
zh_cn: 当他到达十街区之外的兰多夫家的公寓大楼时，他发现帕特西和她的丈夫都在前厅，一个穿着制服的警察站在他们的旁边。

source: Harry knew that the Randolphs were wealthy but the building was much nicer than he'd expected.
zh_cn: 哈里知道兰多夫家很富有，但这栋建筑比他想象的还要漂亮。

source: It was one of the luxurious high-rises that Donald Trump had built in the eighties.
zh_cn: 这是唐纳德·特朗普在八十年代建造的豪华建筑之一。

source: There were penthouse triplexes selling for $20 million, Harry had read in theTimes.
zh_cn: 哈里在《泰晤士报》上读到过，顶楼的公寓翻了三倍，售价两千万。

source: "Doctor," Patsy cried when she saw Harry.
zh_cn: “医生，”帕特西看到了哈里于是叫道。

source: She ran to him.
zh_cn: 她跑向他。

source: Harry was careful about physical contact with his patients.
zh_cn: 哈里十分留意与病人的肢体接触。

source: He knew all about transference and countertransference- the perfectly normal attraction between patients and their therapists- but contact had to be handled carefully. Harry took Patsy by the shoulders so that she couldn't hug him and led her back to the lobby couch.
zh_cn: 他知道那些移情和反移情作用——病人与治疗师之间完全正常的吸引关系——但这样的接触需要小心的掌控。

source: "Mr. Randolph?"
zh_cn: “兰多夫先生？”

source: Harry asked, turning to her husband.
zh_cn: 哈里问道，转向她的丈夫。

source: "That's right."
zh_cn: “是的。”

source: "I'm Harry Bernstein."
zh_cn: “我是哈里·伯恩斯坦。”

source: The men shook hands.
zh_cn: 两人互相握了握手。

source: Peter Randolph was very much what Harry was expecting.
zh_cn: 彼得·兰多夫与哈里想象的十分相像。

source: He was a trim, athletic man of about forty.
zh_cn: 他是一个四十岁上下整洁而健壮的男人。

source: Handsome.
zh_cn: 非常英俊。

source: His eyes were angry and bewildered and looked victimized.
zh_cn: 他的眼里充满了愤怒和困惑，看起来像是受到了伤害。

source: He reminded Harry of a patient he'd treated briefly- a man whose sole complaint was that he was having trouble maintaining a life with a wife and two mistresses.
zh_cn: 他让哈里想起了他短暂治疗过的一个病人——一个抱怨不知该如何维持一个妻子两个情人的生活的人。

source: Peter wore a burgundy silk bathrobe and supple leather slippers.
zh_cn: 彼得穿着一件酒红色的丝质浴袍和柔软的皮拖鞋。

source: "Would you mind if I spoke to Patsy alone?" Harry asked him.
zh_cn: “你介意我和帕特西单独谈谈吗？”哈里问他。

source: "No. I'll be upstairs if you need me."
zh_cn: “不介意，如果有什么需要的话，我在楼上。”

source: He said this to both Harry and the police officer.
zh_cn: 他对哈里和警察说道。

source: Harry too glanced at the cop, who also stepped away and let the doctor talk to his patient.
zh_cn: 哈里看了看警察，他也走开了，让医生和他的病人谈话。

source: "What happened?" Harry asked Patsy.
zh_cn: “发生了什么事？”哈里问帕特西。

source: "The bird," she said, choking back tears.
zh_cn: “鸟，”她说道，抑制着自己的眼泪。

source: "One of the ceramic birds?"
zh_cn: “那些陶瓷鸟中的一只？”

source: "Yes," she whispered. "He broke it."
zh_cn: “是的，”她小声说道，“他打破了它。”

source: Harry studied her carefully.
zh_cn: 哈里仔细打量着她。

source: She was in bad shape tonight.
zh_cn: 今晚她看起来很糟糕。

source: Hair stringy, robe filthy, fingernails unclean.
zh_cn: 头发卷曲，长袍污浊，指甲没有清理干净。

source: As in her session the other day, only her makeup was normal.
zh_cn: 如同那天进行治疗时一样，只有她的妆容是正常的。

source: "Tell me about what happened."
zh_cn: “告诉我发生了什么。”

source: "I was asleep and then I heard this voice say, 'Run! You have to get out. They're almost here. They're going to hurt you.'
zh_cn: “我正在睡觉，接着就听到有个声音在说，‘快跑！快点离开这里，他们快来了，他们要伤害你。’

source: And I jumped out of bed and ran into the living room and there- there was a Boehm bird. The robin. It was shattered and scattered all over the floor.
zh_cn: 我从床上跳了起来，跑到起居室，那里有一只勃姆鸟，是知更鸟，已经被打碎散落了一地。

source: I started screaming- because I knew they were after me."
zh_cn: 我开始尖叫——因为我知道他们在我背后。”

source: Her voice rose. "The ghosts...
zh_cn: 她提高了声调，“那些幽灵......

source: They...
zh_cn: 他们......

source: I mean,Peter was after me.
zh_cn: 是彼得在我背后。

source: I just threw on my robe and escaped."
zh_cn: 于是我匆匆穿上袍子就逃了出来。”

source: "And what did Peter do?"
zh_cn: “彼得做了什么？”

source: "He ran after me."
zh_cn: “他在后面追赶我。”

source: "But he didn't hurt you?"
zh_cn: “但他没有伤害你，是吧？”

source: She hesitated. "No."
zh_cn: 她犹豫道：“没有。”

source: She looked around the cold, marble lobby with paranoid eyes.
zh_cn: 她用偏执的眼睛看着这个冰冷无味的大厅。

source: "Well, what he did was he called the police...
zh_cn: “他打电话给了警察......

source: But don't you see?
zh_cn: 但是你没看出来吗？

source: Peter didn't have any choice.
zh_cn: 彼得没有任何选择。

source: He had to call the police.
zh_cn: 他不得不给警察打电话。

source: Isn't that what somebody would normally do if their wife ran out of the apartment, screaming?
zh_cn: 这不是人通常会做的吗，如果他们的妻子跑出了尖叫着跑出公寓？

source: Not calling them would have been suspicious..."
zh_cn: 不给他们打电话，反而会被怀疑......

source: Harry looked for signs of overmedication or drinking. He could see none.
zh_cn: 哈里寻找着是否有过度服药或饮酒的迹象，但他没有找到。

source: She looked around the lobby once more.
zh_cn: 她再次环顾了大厅。

source: "Are you feeling better now?"
zh_cn: “现在感觉好点了吗？”

source: She nodded. "I'm sorry," she said. "Making you come all the way over here tonight."
zh_cn: 她点点头：“对不起，”她说，“今晚让你一路赶过来。”
